test/liquid_solid_fluidized_bed_semi/force_buoyancy+drag+vm/DiFelice/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.16);

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform (0 0 0.16);
  }
  outlet
  {
    type            zeroGradient;
  }
  walls
  {
    type            fixedValue;
    value           uniform (0 0 0);
    // type noSlip;
  }
}
